package day02;

class ºØ¾î»§{
	
	int °¡°Ý; //ÇÊµåº¯¼ö
	
	public void ºØ¾î»§À»¸¸µé´Ù(String Àç·á) {
		System.out.println(Àç·á + "ºØ¾î»§");
	}
	
	//¹®Á¦ 5. Å©¸² : 1000¿ø / ÆÏ : 1000¿ø / ÇÇÀÚ : 2000¿ø
	public int ºØ¾î»§À»ÆÈ´Ù(int °¡°Ý) {
		this.°¡°Ý = °¡°Ý; //ÆÄ¶ó¹ÌÅÍ·Î ³Ñ¾î¿Â °ªÀ» ÇÊµåº¯¼ö¿¡ ´ëÀÔ
		//this´Â ÇÊµåº¯¼ö¸¦ ÀÇ¹ÌÇÔ
		return °¡°Ý;
	}
}

public class Class_Study02 {
	
	public static void main(String[] args) {

		//¹®Á¦ 4. ºØ¾î»§ Å¬·¡½º¸¦ È£ÃâÇÏ°í ºØ¾î»§À» ¸¸µé´Ù ¸Þ¼Òµå¸¦ ÀÌ¿ëÇØ¼­ Å©¸²ºØ¾î»§, ÆÏºØ¾î»§, ÇÇÀÚºØ¾î»§À» °¢°¢ Ãâ·ÂÇÏ½Ã¿À.
		
		ºØ¾î»§ Å©¸²ºØ¾î»§ = new ºØ¾î»§();
		Å©¸²ºØ¾î»§.ºØ¾î»§À»¸¸µé´Ù("Å©¸²");
		int Å©¸²°¡°Ý = Å©¸²ºØ¾î»§.ºØ¾î»§À»ÆÈ´Ù(1000);
		System.out.println(Å©¸²°¡°Ý);
		System.out.println("ÇÊµåº¯¼ö °ª => " + Å©¸²ºØ¾î»§.°¡°Ý);
		
		ºØ¾î»§ ÆÏºØ¾î»§ = new ºØ¾î»§();
		ÆÏºØ¾î»§.ºØ¾î»§À»¸¸µé´Ù("ÆÏ");
		System.out.println(ÆÏºØ¾î»§.°¡°Ý);
		
		ºØ¾î»§ ÇÇÀÚºØ¾î»§ = new ºØ¾î»§();
		ÇÇÀÚºØ¾î»§.ºØ¾î»§À»¸¸µé´Ù("ÇÇÀÚ");
		int ÇÇÀÚ°¡°Ý = ÇÇÀÚºØ¾î»§.ºØ¾î»§À»ÆÈ´Ù(2000);
		System.out.println(ÇÇÀÚ°¡°Ý);
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
	}

}
